# <center>Łańcuchy znaków i wyrażenia regularne</center>

In [1]:
import main

import numpy as np
import pickle
import psycopg2 as pg
import pandas.io.sql as psql
import pandas as pd

## Zadania wprowadzające

In [ ]:
sql = f'''SELECT
              film.title title, language.name languge, category.name category
          FROM
              category
          INNER JOIN film_category ON category.category_id=film_category.category_id
          INNER JOIN film ON film_category.film_id=film.film_id
          INNER JOIN language ON film.language_id=language.language_id
          WHERE
              {condition}
          ORDER BY
              title, languge;'''
    
pd.read_sql(sql, con=main.connection)

#### 1. Znajdź wszystkie nazwy krajów rozpoczynających się na P.

In [ ]:
sql = f'''SELECT
              country
          FROM
              country
          WHERE
              country ~ '^P'
          ORDER BY
              country;'''
    
pd.read_sql(sql, con=main.connection)

#### 2. Znajdź wszystkie nazwy krajów rozpoczynających się  P i kończących na s.

In [ ]:
sql = f'''SELECT
              country
          FROM
              country
          WHERE
              country ~ '^P[a-z]*s$'
          ORDER BY
              country;'''
    
pd.read_sql(sql, con=main.connection)

#### 3. Znajdź wszystkie tytuły filmów, w których znajdują się cyfry.

In [ ]:
sql = f'''SELECT
              title
          FROM
              film
          WHERE
              title ~ '[0-9]'
          ORDER BY
              title;'''
    
pd.read_sql(sql, con=main.connection)

Nie ma tytułu filmu, który zawierałby cyfry.

#### 4. Znajdź wszystkich pracowników z podwójnym imieniem lub nazwiskiem.

In [8]:
regex = "[ -]"

sql = f'''SELECT
              first_name, last_name
          FROM
              staff
          WHERE
              first_name ~ '{regex}'
          OR
              last_name ~ '{regex}'
          ORDER BY
              last_name, first_name;'''
    
pd.read_sql(sql, con=main.connection)

Empty DataFrame
Columns: [first_name, last_name]
Index: []

Nie ma pracowników, którzy posiadaliby podwójne imię bądź nazwisko.

#### 5. Znajdź wszystkie nazwiska aktorów rozpoczynających się od P lub C i mających 5 znaków.

In [ ]:
regex = "^[PC][a-z]{4}$"

sql = f'''SELECT
              last_name
          FROM
              actor
          WHERE
              last_name ~ '{regex}'
          ORDER BY
              last_name;'''
    
pd.read_sql(sql, con=main.connection)

#### 6. Znajdź wszystkie tytuły filmów, w których występują słowa Trip lub Alone.

In [7]:
sql = f'''SELECT
              title
          FROM
              film
          WHERE
              title ~* 'Trip|Alone'
          ORDER BY
              title;'''
    
pd.read_sql(sql, con=main.connection)

           title
0     Alone Trip
1  Superfly Trip
2    Trip Newton
3   Varsity Trip

#### 7. Przeanalizuj zapytania:
- select first_name from actor where first_name ~ '^Al\[a:z,1:9\]\*'

In [2]:
sql = f'''SELECT
              first_name
          FROM
              actor
          WHERE
              first_name ~ '^Al[a:z,1:9]*';'''
    
pd.read_sql(sql, con=main.connection)

  first_name
0       Alec
1     Albert
2     Albert
3         Al
4       Alan

Kod zwraca wynik zapytania do bazy o imiona aktorów, które zaczynają się od wyrażenia 'Al'. W teorii została dopuszczona możliwość wystąpienia cyfr w imieniu. Nie jest to oczywiście formalnie możliwe, gdyż takie imiona nie istnieją, ale nie wpływa to na szczęście negatywnie na wynik zapytania.

- select first_name from actor where first_name ~\* '^al\[a:z,1:9\]\*'

In [3]:
sql = f'''SELECT
              first_name
          FROM
              actor
          WHERE
              first_name ~* '^al[a:z,1:9]*';'''
    
pd.read_sql(sql, con=main.connection)

  first_name
0       Alec
1     Albert
2     Albert
3         Al
4       Alan

Kod zwraca wynik zapytania do bazy o imiona aktorów, które zaczynają się na od wyrażenia 'al'. W teorii została dopuszczona możliwość wystąpienia cyfr w imieniu. Nie jest to oczywiście formalnie możliwe, gdyż takie imiona nie istnieją, ale nie wpływa to na szczęście negatywnie na wynik zapytania. Wielkość liter nie jest rozróżniana, jednakże imiona w bazie są zapisane jako ciąg znaków, w którym pierwsza litera jest wielka, a pozostałe - małe, zatem to również nie zmienia wyniku zapytania.

Obydwa zapytania zwróciły ten sam wynik.

## Zadanie implementacyjne
Zaimplementuj wszystkie funkcje w pliku main.py zgodnie z opisem a następnie przetestuj je w notatniku.

#### film_in_category()

In [ ]:
main.film_in_category(12)

In [ ]:
main.film_in_category("Music")

In [ ]:
main.film_in_category("music")

Funkcja *film_in_category()* bierze pod uwagę wielkość liter. Dla danej kategorii zwraca taki sam wynik, niezależnie od sposobu podania tejże kategorii - poprzez id lub nazwę.

#### film_in_category_case_insensitive()

In [ ]:
main.film_in_category_case_insensitive("music")

Funkcja *film_in_category_case_insensitive()* nie bierze pod uwagę wielkości liter.

#### film_cast()

In [ ]:
main.film_cast("Iron Moon")

Funkcja *film_cast()* wypisała posortowaną listę aktorów grających w danym filmie.

#### film_title_case_insensitive()

In [ ]:
main.film_title_case_insensitive(['BeD', 'BLOOD', 'SonS', 'son', 'cry'])

In [ ]:
main.film_title_case_insensitive(['Giant', 'Harry', 'Birdcage', 'Iron'])

Funkcja *film_title_case_insensitive()* zwraca wszystkie tytułu zawierające dany wyraz - jako wyraz, a nie jedynie część wyrazu.